#include<stdio.h>
#include<string.h>
#include<stdlib.h>
#include<unistd.h>
#include <time.h>

#include "Account_Logic.h"

Change_For_Userinfo test;

// Filename용 전역변수 하나 지정 필요 -> 초기 파일 필요, 불합격 값 들어있게 생성해야함
void Pass_Test_Result(int score)
{
    FILE * fp = fopen(test.Filename5, "wt");
    char info[100] = "합격,";
    char ch_score[100] = "점수:";
    sprintf(ch_score, "%d", score);
    strcat(info, ch_score);
    fputs(info, fp);
    fclose(fp);
}

void Pass_info(void) // 파일 합쳤을 때 쓸 함수 (실기 합격 여부 조회)
{
    FILE * fp = fopen(test.Filename5, "rt");
    char lines[100];

    fgets(lines, 100, fp);
    fclose(fp);
}


int right_up(int* A, int* B, int* TEMP, int* DEATH, int* SUC, int MAP[][30], int MAP2[][30])    //오른쪽 가속(전진용)
{
    for(*TEMP=0; *TEMP<3; *TEMP++)
    {
        MAP[*A][*B]=MAP2[*A][*B];
        *B+=1;
        if(MAP[*A][*B]==13)
            *SUC+=1;
        else if(MAP[*A][*B]==0 || MAP[*A][*B]==10 || MAP[*A][*B]==11 || MAP[*A][*B]==14)
        {
            *DEATH+=1;
        }
        else
            MAP[*A][*B]=99;
    }
}

int right(int* A, int* B, int* TEMP, int* DEATH, int* SUC, int MAP[][30], int MAP2[][30])       //오른쪽 이동(전진용)
{
    MAP[*A][*B]=MAP2[*A][*B];
    *B+=1;
    if(MAP[*A][*B]==0 || MAP[*A][*B]==10 || MAP[*A][*B]==11 || MAP[*A][*B]==14)
    {
        *DEATH+=1;
    }
    else if(MAP[*A][*B]==13)
        *SUC+=1;
    else
        MAP[*A][*B]=99;
}

int left_up(int* A, int* B, int* TEMP, int* DEATH, int* SUC, int MAP[][30], int MAP2[][30])     //왼쪽 가속(전진용)
{
    for(*TEMP=0; *TEMP<3; *TEMP++)
    {
        MAP[*A][*B]=MAP2[*A][*B];
        *B-=1;
        if(MAP[*A][*B]==13)
            *SUC+=1;
        else if(MAP[*A][*B]==0 || MAP[*A][*B]==10 || MAP[*A][*B]==11 || MAP[*A][*B]==14)
        {
            *DEATH+=1;
        }
        else
            MAP[*A][*B]=99;
    }
}

int left(int* A, int* B, int* TEMP, int* DEATH, int* SUC, int MAP[][30], int MAP2[][30])        //왼쪽 이동
{
    MAP[*A][*B]=MAP2[*A][*B];
    *B-=1;
    if(MAP[*A][*B]==0 || MAP[*A][*B]==10 || MAP[*A][*B]==11 || MAP[*A][*B]==14)
    {
        *DEATH+=1;
    }
    else if(MAP[*A][*B]==13)
        *SUC+=1;
    else
        MAP[*A][*B]=99;
}

int up_up(int* A, int* B, int* TEMP, int* DEATH, int* SUC, int MAP[][30], int MAP2[][30])       //위로 가속
{
    for(*TEMP=0; *TEMP<3; *TEMP++)
    {
        MAP[*A][*B]=MAP2[*A][*B];
        *A-=1;
        if(MAP[*A][*B]==13)
            *SUC+=1;
        else if(MAP[*A][*B]==0 || MAP[*A][*B]==10 || MAP[*A][*B]==11 || MAP[*A][*B]==14)
        {
            *DEATH+=1;
        }
        else
            MAP[*A][*B]=99;
    }
}

int up(int* A, int* B, int* TEMP, int* DEATH, int* SUC, int MAP[][30], int MAP2[][30])          //위로 이동
{

    MAP[*A][*B]=MAP2[*A][*B];
    *A-=1;
    if(MAP[*A][*B]==0 || MAP[*A][*B]==10 || MAP[*A][*B]==11 || MAP[*A][*B]==14)
    {
        *DEATH+=1;
    }
    else if(MAP[*A][*B]==13)
        *SUC+=1;
    else
        MAP[*A][*B]=99;
}

int down_up(int* A, int* B, int* TEMP, int* DEATH, int* SUC, int MAP[][30], int MAP2[][30])     //아래로 가속
{
    for(*TEMP=0; *TEMP<3; *TEMP++)
    {
        MAP[*A][*B]=MAP2[*A][*B];
        *A+=1;
        if(MAP[*A][*B]==13)
            *SUC+=1;
        else if(MAP[*A][*B]==0 || MAP[*A][*B]==10 || MAP[*A][*B]==11 || MAP[*A][*B]==14)
        {
            *DEATH+=1;
        }
        else
            MAP[*A][*B]=99;
    }
}

int down(int* A, int* B, int* TEMP, int* DEATH, int* SUC, int MAP[][30], int MAP2[][30])        //아래로 이동
{
    MAP[*A][*B]=MAP2[*A][*B];
    *A+=1;
    if(MAP[*A][*B]==0 || MAP[*A][*B]==10 || MAP[*A][*B]==11 || MAP[*A][*B]==14)
    {
        *DEATH+=1;
    }
    else if(MAP[*A][*B]==13)
        *SUC+=1;
    else
        MAP[*A][*B]=99;
}

int up1(int* A, int* B, int* TEMP, int* DEATH, int* SUC, int* L, int MAP[][30], int MAP2[][30], int* SCORE)       //위로 차선 변경
{
    MAP[*A][*B]=MAP2[*A][*B];
    *A-=1;
    if(MAP[*A][*B]==0 || MAP[*A][*B]==10 || MAP[*A][*B]==11 || MAP[*A][*B]==14)
    {
        *DEATH+=1;
    }
    else if(MAP[*A][*B]==13)
        *SUC+=1;
    else
    {
        MAP[*A][*B]=99;
        if(*L%2==0)
        {
            *SCORE-=10;
            printf("10점 감점. 현재점수 %d\n", *SCORE);
        }
        *L=0;
    }
}

int down1(int* A, int* B, int* TEMP, int* DEATH, int* SUC, int* L_2, int MAP[][30], int MAP2[][30], int* SCORE)     //아래로 차선 변경
{
    MAP[*A][*B]=MAP2[*A][*B];
    *A+=1;
    if(MAP[*A][*B]==0 || MAP[*A][*B]==10 || MAP[*A][*B]==11)
    {
        *DEATH+=1;
    }
    else if(MAP[*A][*B]==13)
        *SUC+=1;
    else
    {
        MAP[*A][*B]=99;
        if(*L_2%2==0)
        {
            *SCORE-=10;
            printf("10점 감점. 현재점수 %d\n", *SCORE);
        }
        *L_2=0;
    }
}

int left1(int* A, int* B, int* TEMP, int* DEATH, int* SUC, int* L, int MAP[][30], int MAP2[][30], int* SCORE)     //왼으로 차선 변경
{
    MAP[*A][*B]=MAP2[*A][*B];
    *B-=1;
    if(MAP[*A][*B]==0 || MAP[*A][*B]==10 || MAP[*A][*B]==11)
    {
        *DEATH+=1;
    }
    else if(MAP[*A][*B]==13)
        *SUC+=1;
    else
    {
        MAP[*A][*B]=99;
        if(*L%2==0)
        {
            *SCORE-=10;
            printf("10점 감점. 현재점수 %d\n", *SCORE);
        }
        *L=0;
    }
}

int right1(int* A, int* B, int* TEMP, int* DEATH, int* SUC, int* L_2, int MAP[][30], int MAP2[][30], int* SCORE)      //오른으로 차선 변경
{
    MAP[*A][*B]=MAP2[*A][*B];
    *B+=1;
    if(MAP[*A][*B]==0 || MAP[*A][*B]==10 || MAP[*A][*B]==11)
    {
        *DEATH+=1;
    }
    else if(MAP[*A][*B]==13)
        *SUC+=1;
    else
    {
        MAP[*A][*B]=99;
        if(*L_2%2==0)
        {
            *SCORE-=10;
            printf("10점 감점. 현재점수 %d\n", *SCORE);
        }
        *L_2=0;
    }
}

int light_l(int* L_O, int* L_O2)
{
    *L_O2=0;
    if(*L_O%2==0)
    {
        printf("\n좌측 깜빡이 켜짐. 차선 변경 가능\n");
        *L_O+=1;
    }
    else
    {
        printf("\n좌측 깜빡이 꺼짐. 차선 변경 감점\n");
        *L_O+=1;
    }
}

int light_r(int* L_O, int* L_O2)
{
    *L_O=0;
    if(*L_O2%2==0)
    {
        printf("\n우측 깜빡이 켜짐. 차선 변경 가능\n");
        *L_O2+=1;
    }
    else
    {
        printf("\n우측 깜빡이 꺼짐. 차선 변경 감점\n");
        *L_O2+=1;
    }
}

void Test_Score(int score)
{
    FILE * fp = fopen("score.txt", "wt");

    char text[10];
    sprintf(text, "%d", score);
    fputs(text, fp);
    fclose(fp);

}


void maintest()
{
    srand((int)time(NULL));
    int i, j;
    int a, b, p1, p2, p3, p4, tfl1, tfl2, tfl3, tfl4;
    int map[24][30]={};
    int map2[24][30]={};
    int field1[24][30]=
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 4, 4, 4, 4, 10, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 10, 4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 4, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 10, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 4, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 12, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 4, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 12, 4, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 4, 14, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 13, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 12, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 12, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 4, 4, 4, 4, 10, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 10, 4, 4, 4, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 10, 4, 4, 4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};

    int field2[24][30]=
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 
        0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 10, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 
        0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 10, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 
        0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 14, 0, 0, 0, 0, 12, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 4, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 4, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 12, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 12, 4, 14, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 10, 4, 4, 4, 0, 0, 0, 0, 
        4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 
        4, 4, 4, 4, 4, 4, 4, 10, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 13, 0, 0, 0, 0};

    int field3[24][30]=
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 10, 4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 10, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 4, 10, 0, 0, 0, 0, 0, 0, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 12, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 12, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 10, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 4, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 12, 4, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 4, 10, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 4, 10, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 12, 4, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 12, 4, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 10, 4, 4, 4, 4, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 4, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 4, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 13, 0, 0, 0, 0, 
        0, 0, 0, 0, 14, 4, 4, 4, 4, 4, 10, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 13, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};

    int field4[24][30]=
        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 4, 4, 4, 4, 4, 10, 4, 4, 4, 4, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 
        0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 14, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 4, 10, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 4, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 4, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 0, 0, 4, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 12, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 0, 0, 4, 10, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 12, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 4, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 4, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 4, 4, 0, 0, 4, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 10, 4, 4, 0, 0, 0, 0, 4, 4, 0, 0, 12, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 14, 4, 4, 0, 0, 12, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 4, 4, 0, 0, 4, 12, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 4, 4, 0, 0, 4, 12, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 4, 4, 0, 0, 4, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 4, 4, 0, 0, 4, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 4, 4, 0, 0, 4, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 10, 4, 4, 4, 4, 4, 4, 0, 0, 4, 4, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 0, 0, 13, 13, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};

    int temp;
    int light_odd=0;            //좌측 깜빡이 쓸때
    int light_odd2=0;           //우측 깜빡이 쓸때
    int start=0;
    int score=100;              //점수
    int direc=1000;                  //방향
    int turn=0;                 //턴 횟수
    int x, y;                   //신호위반 for문
    int s=0;                    //신호위반 변수

    int map_choose = rand() % 4; // 0 ~ 3중에 랜덤 출력

    int death=0;            //실격
    int suc=0;              //합격


    char move1='x';               //사용자 움직임
    // map[a][b]=99;

    if (map_choose == 0)
        {
            a=23;
            b=0;
            p1=8;
            p2=3;
            p3=12;
            p4=21;
            tfl1=10;
            tfl2=6;
            tfl3=10;
            tfl4=24;
            for(i=0; i<24; i++)
            {
                for(j=0; j<30; j++)
                {
                    map[i][j]=field1[i][j];
                    map2[i][j]=field1[i][j];
                }
            }
        }
        

        else if(map_choose == 1)
        {
            a=21;
            b=0;
            p1=15;
            p2=7;               //보행자 위치
            p3=14;
            p4=18;           //보행자 위치
            tfl1=16;
            tfl2=10;         //신호등 위치
            tfl3=12;
            tfl4=14;        //신호등 위치
            for(i=0; i<24; i++)
            {
                for(j=0; j<30; j++)
                {
                    map[i][j]=field2[i][j];
                    map2[i][j]=field2[i][j];
                }
            }


        }

        else if(map_choose==2)
        {
            a=9;
            b=13;
            p1=7;
            p2=22;               //보행자 위치
            p3=16;
            p4=4;           //보행자 위치
            tfl1=19;
            tfl2=4;         //신호등 위치
            tfl3=5;
            tfl4=13;        //신호등 위치
            for(i=0; i<24; i++)
            {
                for(j=0; j<30; j++)
                {
                    map[i][j]=field3[i][j];
                    map2[i][j]=field3[i][j];
                }
            }
        }

        else if(map_choose==3)
        {
            a=3;
            b=2;
            p1=7;
            p2=9;               //보행자 위치
            p3=15;
            p4=23;           //보행자 위치
            tfl1=3;
            tfl2=26;         //신호등 위치
            tfl3=12;
            tfl4=19;        //신호등 위치
            for(i=0; i<24; i++)
            {
                for(j=0; j<30; j++)
                {
                    map[i][j]=field4[i][j];
                    map2[i][j]=field4[i][j];
                }
            }
        }
    while(1)
    //w 2턴당 한칸, r 속도 증가, q,e 깜빡이
    //a 좌 차선변경, d 우 차선변경, z 좌회전, c 우회전, s 속도 감소
    
    {



        char move1='x';
        map[a][b]=99;
        map[p1][p2]=11;
        map[p3][p4]=11;
        map[tfl1][tfl2]=15;
        map[tfl3][tfl4]=15;
        if(start==0)
        {
            printf("\nw를 눌러 시동을 걸어주세요\n");
            scanf(" %c", &move1);
            if(move1!='w')
            {
                printf("실격\n");
                break;
            }
            else
            {
                start=1;
            }
        }
        else
        {
            turn+=1;
            printf("%d번째 턴입니다.", turn);
            printf("\n1단:w\t가속:r\t후진:s\t제자리에 멈추기:b\t좌측 깜빡이:q\t우측 깜빡이:e\n");
            printf("좌측 차선 변경:a\t우측 차선변경:d\t\t좌회전:z\t우회전:c");
            printf("\n행동 입력");

            scanf(" %c", &move1);
            if(move1=='z')
            {
                direc+=1; 
            }
            else if(move1=='c')
            {
                direc-=1;

            }
        }
        system("clear");
        if(direc%4==0)            //방향전환 없을 시(조건은 %4로 인한 나머지)///////////
        {
            if(move1=='r')    //증가 속도
                right_up(&a, &b, &temp, &death, &suc, map, map2);
            
            else if(move1=='w')     //일정 속도
                right(&a, &b, &temp, &death, &suc, map, map2);
            
            else if(move1=='s')     //속도 감소
                left(&a, &b, &temp, &death, &suc, map, map2);
            
            else if(move1=='q')          //좌측 깜빡이
                light_l(&light_odd, &light_odd2);
            
            else if(move1=='a')         //위로 차선변경
                up1(&a, &b, &temp, &death, &suc, &light_odd, map, map2, &score);
            
            else if(move1=='e')          //우측 깜빡이
                light_r(&light_odd, &light_odd2);
            
            else if(move1=='d')         //아래로 차선변경
                down1(&a, &b, &temp, &death, &suc, &light_odd2, map, map2, &score);
            

        }
        //////////////////방향전환//////////////////////////////////////////////////
        else if(direc%4==1)
        {
            if(move1=='r')    //위로 증가 속도
                up_up(&a, &b, &temp, &death, &suc, map, map2);
            
            else if(move1=='w')     //일정 속도
                up(&a, &b, &temp, &death, &suc, map, map2);
            
            else if(move1=='s')     //속도 감소
                down(&a, &b, &temp, &death, &suc, map, map2);
            
            else if(move1=='q')          //좌측 깜빡이
                light_l(&light_odd, &light_odd2);
            
            else if(move1=='a')         //왼으로 차선변경
                left1(&a, &b, &temp, &death, &suc, &light_odd, map, map2, &score);
            
            else if(move1=='e')          //우측 깜빡이
                light_r(&light_odd, &light_odd2);
            
            else if(move1=='d')         //오른으로 차선변경
                right1(&a, &b, &temp, &death, &suc, &light_odd2, map, map2, &score);
            

        }
        ///////////////////////////방향전환////////////////////////////////////
        else if(direc%4==2)
        {
            if(move1=='r')    //증가 속도
                left_up(&a, &b, &temp, &death, &suc, map, map2);
            
            else if(move1=='w')     //일정 속도
                left(&a, &b, &temp, &death, &suc, map, map2);
            
            else if(move1=='s')     //속도 감소
                right(&a, &b, &temp, &death, &suc, map, map2);
            
            else if(move1=='q')          //좌측 깜빡이
                light_l(&light_odd, &light_odd2);
            
            else if(move1=='a')         //아래로 차선변경
                down1(&a, &b, &temp, &death, &suc, &light_odd, map, map2, &score);
            
            else if(move1=='e')          //우측 깜빡이
                light_r(&light_odd, &light_odd2);
            
            else if(move1=='d')         //위로 차선변경
                up1(&a, &b, &temp, &death, &suc, &light_odd2, map, map2, &score);
            

        }
        ////////////////////////방향전환///////////////////////////////////
        else if(direc%4==3)
        {
            if(move1=='r')    //증가 속도
                down_up(&a, &b, &temp, &death, &suc, map, map2);
            
            else if(move1=='w')     //일정 속도
                down(&a, &b, &temp, &death, &suc, map, map2);
            
            else if(move1=='s')     //속도 감소
                up(&a, &b, &temp, &death, &suc, map, map2);
            
            else if(move1=='q')          //좌측 깜빡이
                light_l(&light_odd, &light_odd2);

            else if(move1=='a')         //오른으로 차선변경
                right1(&a, &b, &temp, &death, &suc, &light_odd, map, map2, &score);
            
            else if(move1=='e')          //우측 깜빡이
                light_r(&light_odd, &light_odd2);
            
            else if(move1=='d')         //왼으로 차선변경
                left1(&a, &b, &temp, &death, &suc, &light_odd2, map, map2, &score);
            
        }

        for(int i=0; i<24; i++)         //맵 출력
        {
            for(int j=0; j<30; j++)
            {
                if(map[i][j]==99)
                    printf("🚗 ");
                else if(map[i][j]==4)
                    printf("⬛ ");
                else if(map[i][j]==10)
                    printf("🚙 ");
                else if(map[i][j]==11)
                    printf("😃 ");
                else if(map[i][j]==12)
                    printf("⬜ ");
                else if(map[i][j]==13)
                    printf("❎ ");
                else if(map[i][j]==14)
                    printf("🚦 ");
                else if(map[i][j]==15)
                {
                    if(turn%5==0 || turn%5==1)
                    {
                        printf("🟩 ");
                    }
                    else if(turn%5==2)
                        printf("🟨 ");
                    else if(turn%5==3 || turn%5==4)
                    {
                        printf("🟥 ");
                        for(x=0; x<3; x++)
                        {
                            for(y=0; y<5; y++)
                            {
                                if(map[a][b]==map[i-1+x][j-2+y] || map[a][b]==map[i-2+y][j-1+x])
                                {
                                    s+=1;
                                }
                            }
                        }
                    }
                }

                else if(map[i][j]==0)
                    printf("▪️  ");
            }
            printf("\n");
        }
        map[p1][p2]=map2[p1][p2];
        map[p3][p4]=map2[p3][p4];
        if(map[p1][p2]==map[a][b] || map[p3][p4]==map[a][b])
            death++;
        p2+=1;
        p4+=1;
        map[p1][p2]=11;
        map[p3][p4]=11;
        if(turn%4==3)
        {
            map[p1][p2]=map2[p1][p2];
            map[p3][p4]=map2[p3][p4];
            p2-=4;
            p4-=4;
        }

        if(suc>0)
        {
            system("clear");
            printf("합격! 점수는 %d점입니다.\n", score);
            Test_Score(score); // 점수 파일에 저장
            break;
        }
        else if(s==1 || death>0 || score<70)
        {
            system("clear");
            printf("실격되었습니다.");
            break;
        }

    }
}



